cases/isoStaticDroplet2D/system/controlDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     leiaSemiLagrangianLevelSetTwoPhaseFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         @!END_TIME!@;

deltaT          1e-5;

writeControl    adjustableRunTime;
writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   8;

runTimeModifiable no;

// Explicit surface tension => capillary time-step limit
//   dt_sigma = sqrt((rho1+rho2) dx^3 / (2 pi sigma)) ~ 2.6e-4 s at 32^2.
// The parasitic-current feedback is only STABLE well below dt_sigma; the study
// runs at maxDeltaT ~ dt_sigma/4 with maxCo 0.1, and maxDeltaT is scaled with the
// mesh as dt ~ dx^1.5 by the derived token below (materialize computes
//   MAX_DELTA_T = CAPILLARY_DT_COEFF / N_CELLS^1.5,  coeff = @!CAPILLARY_DT_COEFF!@ s
// calibrated so maxDeltaT(N=32) ~ dt_sigma/4). Diverges if run at ~dt_sigma.
adjustTimeStep  yes;
maxCo           @!MAX_CO!@;
maxAlphaCo      @!MAX_CO!@;
maxDeltaT       @!MAX_DELTA_T!@;

// Parasitic-current metrics (max|U|, mean|U|) + the Laplace jump are written every
// step to leiaSemiLagrangianLevelSetTwoPhaseFoam.csv by the solver (probe-free,
// mesh-robust); that CSV is what the study aggregates. No function objects needed.

// ************************************************************************* //
